; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v2 - type_1 ?v6 - type_3)
 	      (pred_4 ?v7 - object ?v6 - type_3)
	      (pred_1 ?v2 - type_1 ?v5 - type_2)
	      (pred_2 ?v2 - type_1 ?v7 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v2 - type_1 ?v1 ?v8 - type_3)
       :precondition (and  (pred_3 ?v2 ?v1))
       :effect (and  (pred_3 ?v2 ?v8)
		     (not (pred_3 ?v2 ?v1))))

   (:action op_1
       :parameters (?v2 - type_1 ?v3 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v4) (pred_3 ?v2 ?v4) (pred_1 ?v2 ?v5))
       :effect (and (pred_2 ?v2 ?v3 ?v5)
		    (not (pred_4 ?v3 ?v4)) 
		    (not (pred_1 ?v2 ?v5))))

   (:action op_3
       :parameters (?v2 - type_1 ?v3 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v3 ?v5) (pred_3 ?v2 ?v4))
       :effect (and (pred_4 ?v3 ?v4)
		    (pred_1 ?v2 ?v5)
		    (not (pred_2 ?v2 ?v3 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_05 - type_1
obj_06 obj_08 - type_2
obj_01 obj_02 obj_09 obj_04 - type_3
obj_07 obj_03 obj_10 - object)
(:init
(pred_3 obj_05 obj_09)
(pred_1 obj_05 obj_06)
(pred_1 obj_05 obj_08)
(pred_4 obj_07 obj_01)
(pred_4 obj_03 obj_02)
(pred_4 obj_10 obj_01)
)
(:goal
(and
(pred_4 obj_07 obj_09)
(pred_4 obj_03 obj_02)
(pred_4 obj_10 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_05 ?b obj_08))))
)
)

; plan
1. (op_2 obj_05 obj_09 obj_01)
   deleted: (pred_3 obj_05 obj_09)
   added: (pred_3 obj_05 obj_01)
   goals met: 1 of 3
2. (op_1 obj_05 obj_07 obj_01 obj_06)
   deleted: (pred_4 obj_07 obj_01) (pred_1 obj_05 obj_06)
   added: (pred_2 obj_05 obj_07 obj_06)
   goals met: 1 of 3
3. (op_2 obj_05 obj_01 obj_09)
   deleted: (pred_3 obj_05 obj_01)
   added: (pred_3 obj_05 obj_09)
   goals met: 1 of 3
4. (op_3 obj_05 obj_07 obj_09 obj_06)
   deleted: (pred_2 obj_05 obj_07 obj_06)
   added: (pred_4 obj_07 obj_09) (pred_1 obj_05 obj_06)
   goals met: 2 of 3
5. (op_2 obj_05 obj_09 obj_01)
   deleted: (pred_3 obj_05 obj_09)
   added: (pred_3 obj_05 obj_01)
   goals met: 2 of 3
6. (op_1 obj_05 obj_10 obj_01 obj_06)
   deleted: (pred_4 obj_10 obj_01) (pred_1 obj_05 obj_06)
   added: (pred_2 obj_05 obj_10 obj_06)
   goals met: 2 of 3
7. (op_2 obj_05 obj_01 obj_04)
   deleted: (pred_3 obj_05 obj_01)
   added: (pred_3 obj_05 obj_04)
   goals met: 2 of 3
8. (op_3 obj_05 obj_10 obj_04 obj_06)
   deleted: (pred_2 obj_05 obj_10 obj_06)
   added: (pred_4 obj_10 obj_04) (pred_1 obj_05 obj_06)
   goals met: 3 of 3
